
&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	Объект.НомерСчета = СтрЗаменить(Объект.НомерСчета, " ", "");
	УстановитьНаименованиеСчета(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНаименованиеСчета(Форма, ИзменениеНомераСчета = Ложь)
	
	Объект = Форма.Объект;
	
	Объект.Наименование = СформироватьАвтоНаименование(Форма);
				
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьАвтоНаименование(Форма, Знач Текст = "")
	
	Элементы     = Форма.Элементы;
	Объект       = Форма.Объект;
	
	ПредставлениеВалюты = "Руб." ;
	
	ПредставлениеБанка = "";
	Если ЗначениеЗаполнено(Объект.Банк) Тогда
		ПредставлениеБанка = СокрЛП(Форма.Объект.Банк);
	КонецЕсли;
	
	ЭлементыНаименования = Новый Массив;
	Если Не ПустаяСтрока(Форма.Объект.НомерСчета) Тогда
		ЭлементыНаименования.Добавить(Форма.Объект.НомерСчета);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПредставлениеВалюты) Тогда
		ЭлементыНаименования.Добавить(СтрШаблон(НСтр("ru = '(%1)'"), ПредставлениеВалюты));
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПредставлениеБанка) Тогда
		ЭлементыНаименования.Добавить(СтрШаблон(НСтр("ru = 'в %1'"), ПредставлениеБанка));
	КонецЕсли;
	
	Наименование = СтрСоединить(ЭлементыНаименования, " ");
	        	
	Возврат Наименование;
	
КонецФункции

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
		
	УстановитьНаименованиеСчета(ЭтаФорма);
	
КонецПроцедуры
